import "./App.css";
import "antd/dist/antd.min.css";
import "antd/dist/antd.min.js";
import rootContext from "./context";
import Table from "./components/Table";
import { ConfigProvider } from "antd";
import Card from "./components/Card";
import PieChart from "./components/PieChart";
import { useContext } from "react";

const App = () => {
  const { edalatData, pieData, dataSource, columns } = useContext(rootContext);

  // const edalatData = [
  //   {
  //     title: "ارزش پرتفوی 1 میلیون تومانی",
  //     name: "\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a 1 \u0645\u06cc\u0644\u06cc\u0648\u0646 \u062a\u0648\u0645\u0627\u0646\u06cc",
  //     last_value: 132216868.0,
  //     last7Return: -0.06276012354336274,
  //     last30Return: -0.13583309803258026,
  //     last1400Ind: -187601376425285.0,
  //   },
  //   {
  //     title: "ارزش پرتفوی 500 هزار تومانی",
  //     name: "\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a 500 \u0647\u0632\u0627\u0631 \u062a\u0648\u0645\u0627\u0646\u06cc",
  //     last_value: 66026658.0,
  //     last7Return: -0.06279356784088504,
  //     last30Return: -0.13588716227418265,
  //     last1400Ind: -187601376425285.0,
  //   },
  // ];
  // const dataSource = [
  //   {
  //     nemad: "\u0648\u0633\u0627\u0631\u0628\u064a\u0644",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0627\u0631\u062f\u0628\u064a\u0644",
  //     nav: 860.0244666176,
  //     pnav: 1.4883297507,
  //     longTermInvestment: 54360258.899019,
  //     mc: 80905990575360.0,
  //     NI: 25728469000000,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0627\u0631\u0628\u064a\u0644",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0622\u0630\u0631\u0628\u0627\u064a\u062c\u0627\u0646 \u0634\u0631\u0642\u064a",
  //     nav: 1005.0441351836,
  //     pnav: 0.44674655,
  //     longTermInvestment: 205509279.13382602,
  //     mc: 91810561447860.0,
  //     NI: -56583057000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0627\u063a\u0631\u0628\u064a",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0622\u0630\u0631\u0628\u0627\u064a\u062c\u0627\u0646 \u063a\u0631\u0628\u064a",
  //     nav: 1005.8324074643,
  //     pnav: 0.4324776143,
  //     longTermInvestment: 159681962.74513194,
  //     mc: 69058874300190.0,
  //     NI: -42007369000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0628\u0648\u0634\u0647\u0631",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0628\u0648\u0634\u0647\u0631",
  //     nav: 935.1905983923,
  //     pnav: 1.3473189339,
  //     longTermInvestment: 45099572.55434699,
  //     mc: 60763508012340.0,
  //     NI: 90399000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u062e\u0631\u0627\u062c",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u062e\u0631\u0627\u0633\u0627\u0646 \u062c\u0646\u0648\u0628\u064a",
  //     nav: 1012.3539066375,
  //     pnav: 2.1820432415,
  //     longTermInvestment: 62157335.546059,
  //     mc: 135629993938877.0,
  //     NI: -16470838000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u062e\u0631\u0627\u0634",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u062e\u0631\u0627\u0633\u0627\u0646 \u0634\u0645\u0627\u0644\u064a",
  //     nav: 1003.2254513494,
  //     pnav: 1.3645985538,
  //     longTermInvestment: 68806166.54571998,
  //     mc: 93892795357601.0,
  //     NI: -18973292000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u062e\u0648\u0632",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u062e\u0648\u0632\u0633\u062a\u0627\u0646",
  //     nav: 1005.6124764469,
  //     pnav: 0.6314559683,
  //     longTermInvestment: 258301696.045655,
  //     mc: 163106147577375.0,
  //     NI: -68081523000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0631\u0636\u0648\u064a",
  //     nameFA:
  //       "\u0633.\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a \u0627\u0633\u062a\u0627\u0646 \u062e\u0631\u0627\u0633\u0627\u0646 \u0631\u0636\u0648\u064a",
  //     nav: 1023.8994932684,
  //     pnav: 0.7090539694,
  //     longTermInvestment: 358383081.75044304,
  //     mc: 254112946691934.0,
  //     NI: -90984646000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0632\u0646\u062c\u0627\u0646",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0632\u0646\u062c\u0627\u0646",
  //     nav: 1010.446616691,
  //     pnav: 1.4043295079,
  //     longTermInvestment: 47544232.69795501,
  //     mc: 66767768909292.0,
  //     NI: -20359954000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0635\u0641\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0627\u0635\u0641\u0647\u0627\u0646",
  //     nav: 1005.7787874706,
  //     pnav: 0.7248114686,
  //     longTermInvestment: 232586767.34648994,
  //     mc: 168581556409635.0,
  //     NI: -43762533000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0641\u0627\u0631\u0633",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0641\u0627\u0631\u0633",
  //     nav: 980.7514764304,
  //     pnav: 1.0502150899,
  //     longTermInvestment: 258684847.11713997,
  //     mc: 271674729973830.0,
  //     NI: -66653500000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0642\u0632\u0648\u064a\u0646",
  //     nameFA:
  //       "\u0633\u0631\u0645\u0627\u064a\u0647 \u06af\u0630\u0627\u0631\u064a \u0639\u062f\u0627\u0644\u062a \u0627\u0633\u062a\u0627\u0646 \u0642\u0632\u0648\u064a\u0646",
  //     nav: 1.0,
  //     pnav: 1000.0,
  //     longTermInvestment: 59885341.723282,
  //     mc: 0.0,
  //     NI: -26195474000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0642\u0645",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0642\u0645",
  //     nav: 1014.5727477896,
  //     pnav: 1.3138535437,
  //     longTermInvestment: 53078884.942986995,
  //     mc: 69737881076690.0,
  //     NI: -13657358000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0643\u0631\u062f",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0643\u0631\u062f\u0633\u062a\u0627\u0646",
  //     nav: 1005.8204731179,
  //     pnav: 0.4404364515,
  //     longTermInvestment: 91748551.22387901,
  //     mc: 40409406328930.0,
  //     NI: -38316216000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0643\u0631\u0634\u0627",
  //     nameFA:
  //       "\u0633.\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a \u0627\u0633\u062a\u0627\u0646 \u0643\u0631\u0645\u0627\u0646\u0634\u0627\u0647",
  //     nav: 1005.8164834205,
  //     pnav: 0.44342085,
  //     longTermInvestment: 86187077.853885,
  //     mc: 38217147319074.0,
  //     NI: -23790692000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0643\u0631\u0645\u0627\u0646",
  //     nameFA:
  //       "\u0633.\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a \u0627\u0633\u062a\u0627\u0646 \u0643\u0631\u0645\u0627\u0646",
  //     nav: 1006.272217484,
  //     pnav: 0.448188862,
  //     longTermInvestment: 177547202.00158504,
  //     mc: 79574678413483.0,
  //     NI: -73861779000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u06af\u0644\u0633\u062a\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u06af\u0644\u0633\u062a\u0627\u0646",
  //     nav: 850.9077025357,
  //     pnav: 0.8696595386,
  //     longTermInvestment: 102016455.62902603,
  //     mc: 88719583734540.0,
  //     NI: -36454578000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u06af\u064a\u0644\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u06af\u064a\u0644\u0627\u0646",
  //     nav: 1031.9528417849,
  //     pnav: 0.4205618536,
  //     longTermInvestment: 154290024.22910398,
  //     mc: 64888498586436.0,
  //     NI: -39678912000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0644\u0631\u0633\u062a\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0644\u0631\u0633\u062a\u0627\u0646",
  //     nav: 860.0145957931,
  //     pnav: 0.5476651237,
  //     longTermInvestment: 79912291.73500304,
  //     mc: 43765175139240.0,
  //     NI: -27899666000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0645\u0627\u0632\u0646",
  //     nameFA:
  //       "\u0633.\u0633\u0647\u0627\u0645 \u0639\u062f\u0627\u0644\u062a \u0627\u0633\u062a\u0627\u0646 \u0645\u0627\u0632\u0646\u062f\u0631\u0627\u0646",
  //     nav: 1005.8301210224,
  //     pnav: 0.9643775621,
  //     longTermInvestment: 189671017.15536296,
  //     mc: 182914473125630.0,
  //     NI: -211117397000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0645\u062d\u0627\u0644",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633.\u0627\u0633\u062a\u0627\u0646 \u0686\u0647\u0627\u0631\u0645\u062d\u0627\u0644 \u0648\u0628\u062e\u062a\u064a\u0627\u0631\u064a",
  //     nav: 1.0,
  //     pnav: 1000.0,
  //     longTermInvestment: 56769559.35453202,
  //     mc: 0.0,
  //     NI: -18769995000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0645\u0631\u0643\u0632",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0645\u0631\u0643\u0632\u064a",
  //     nav: 950.0903451365,
  //     pnav: 1.4735440763,
  //     longTermInvestment: 74080010.62818699,
  //     mc: 109160160831400.0,
  //     NI: -23766777000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0647\u0631\u0645\u0632",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0647\u0631\u0645\u0632\u06af\u0627\u0646",
  //     nav: 918.9238139497,
  //     pnav: 0.7051727142,
  //     longTermInvestment: 88315202.859472,
  //     mc: 62277471303048.0,
  //     NI: 1.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u0647\u0645\u062f\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0647\u0645\u062f\u0627\u0646",
  //     nav: 924.5501149133,
  //     pnav: 0.5548644597,
  //     longTermInvestment: 105877972.58974302,
  //     mc: 58747924057779.0,
  //     NI: -49662797000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u064a\u0632\u062f",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u064a\u0632\u062f",
  //     nav: 863.8955147389,
  //     pnav: 1.4747153773,
  //     longTermInvestment: 51413567.134336,
  //     mc: 75820378056878.0,
  //     NI: 1.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u064a\u0633\u062a\u0627",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0633\u064a\u0633\u062a\u0627\u0646 \u0648\u0628\u0644\u0648\u0686\u0633\u062a\u0627\u0646",
  //     nav: 1005.848153666,
  //     pnav: 0.6134126685,
  //     longTermInvestment: 159145331.96167696,
  //     mc: 97621762750641.0,
  //     NI: -43109483000000.0,
  //   },
  //   {
  //     nemad: "\u0648\u0633\u064a\u0644\u0627\u0645",
  //     nameFA:
  //       "\u0634\u0631\u0643\u062a \u0633 \u0627\u0633\u062a\u0627\u0646 \u0627\u064a\u0644\u0627\u0645",
  //     nav: 1005.8307367193,
  //     pnav: 1.232811799,
  //     longTermInvestment: 29462440.450827,
  //     mc: 36321644214400.0,
  //     NI: 11545534000000.0,
  //   },
  // ];
  // const columns = [
  //   {
  //     title: "نام نماد",
  //     dataIndex: "nemad",
  //     key: "nemad",
  //     sorter: (a, b) => a.nemad.length - b.nemad.length,
  //   },
  //   {
  //     title: "ارزش خالص دارایی",
  //     dataIndex: "nav",
  //     key: "nav",
  //     defaultSortOrder: "descend",
  //     sorter: (a, b) => a.nav - b.nav,
  //   },
  //   {
  //     title: "نسبت قیمت به ارزش خالص دارایی",
  //     dataIndex: "pnav",
  //     key: "pnav",
  //     defaultSortOrder: "descend",
  //     sorter: (a, b) => a.pnav - b.pnav,
  //   },
  //   {
  //     title: "مقدار سرمایه گذاری بلند مدت",
  //     dataIndex: "longTermInvestment",
  //     key: "longTermInvestment",
  //     defaultSortOrder: "descend",
  //     sorter: (a, b) => a.longTermInvestment - b.longTermInvestment,
  //   },
  //   {
  //     title: "ارزش بازار",
  //     dataIndex: "mc",
  //     key: "mc",
  //     defaultSortOrder: "descend",
  //     sorter: (a, b) => a.mc - b.mc,
  //   },
  //   {
  //     title: "سود خالص",
  //     dataIndex: "NI",
  //     key: "NI",
  //     defaultSortOrder: "descend",
  //     sorter: (a, b) => a.NI - b.NI,
  //   },
  // ];
  // const pieData = [
  //   {
  //     type: "\u0641\u0648\u0644\u0627\u062f",
  //     value: 30933240.0,
  //   },
  //   {
  //     type: "\u0641\u0627\u0631\u0633",
  //     value: 19419200.0,
  //   },
  //   {
  //     type: "\u0645\u0627\u0631\u0648\u0646",
  //     value: 15008400.0,
  //   },
  //   {
  //     type: "\u06a9\u0686\u0627\u062f",
  //     value: 11387160.0,
  //   },
  //   {
  //     type: "\u0641\u0645\u0644\u06cc",
  //     value: 6692560.0,
  //   },
  //   {
  //     type: "\u0634\u0628\u0646\u062f\u0631",
  //     value: 5759600.0,
  //   },
  //   {
  //     type: "\u06a9\u06af\u0644",
  //     value: 5405100.0,
  //   },
  //   {
  //     type: "\u0648\u062a\u062c\u0627\u0631\u062a",
  //     value: 5388732.0,
  //   },
  //   {
  //     type: "\u0648\u0628\u0635\u0627\u062f\u0631",
  //     value: 4396927.0,
  //   },
  //   {
  //     type: "\u0634\u062a\u0631\u0627\u0646",
  //     value: 4231914.0,
  //   },
  //   {
  //     type: "\u062f\u06cc\u06af\u0631",
  //     value: 23594035.0,
  //   },
  // ];

  return (
    <ConfigProvider direction="rtl">
      <div className="container mx-auto pb-8">
        <h1 className="text-4xl text-center mt-8 mb-12">پروژه عدالت</h1>
        <div className="flex flex-col md:flex-row justify-center md:justify-around items-center">
          {edalatData.map((data, index) => (
            <Card key={index} data={data} />
          ))}
        </div>
        <div className="my-8">
          <PieChart pieData={pieData} />
        </div>
        <Table dataSource={dataSource} columns={columns} />
      </div>
    </ConfigProvider>
  );
};

export default App;
